[
    {
      "id": 1,
      "image": "https://img.freepik.com/premium-photo/small-functional-condominium-with-its-own-enclosed-area-garage-swimming-pool_101266-1906.jpg?w=740",
      "title": "Modern Apartment in Downtown",
      "segment_name": "Apartment",
      "description": "This luxurious apartment is a testament to urban sophistication, situated in the bustling heart of the city. Boasting contemporary design and upscale amenities, it offers a stylish retreat for those seeking modern city living. With features like a swimming pool, gym, and 24/7 security, residents can enjoy the ultimate in convenience and comfort, all within reach of downtown's vibrant attractions and business districts.",
      "price": 200000,
      "status": "sell",
      "area": 1200,
      "location": "Downtown, City",
      "facilities": ["Swimming Pool", "Gym", "24/7 Security"]
    },
    {
      "id": 2,
      "image": "https://img.freepik.com/premium-photo/modern-house-with-carport-lawn-with-mini-garden_101266-84.jpg?w=740",
      "title": "Cozy Family Home",
      "segment_name": "House",
      "description": "Nestled in a tranquil suburban neighborhood, this cozy family home beckons with its warmth and charm. Spacious rooms and a beautiful garden provide ample space for relaxation and entertainment, while amenities such as a garage and fireplace add to the comfort and convenience. Ideal for families seeking a peaceful retreat, this home offers a perfect balance of suburban serenity and modern comfort.",
      "price": 300000,
      "status": "sell",
      "area": 1800,
      "location": "Suburban Neighborhood",
      "facilities": ["Garden", "Garage", "Fireplace"]
    },
    {
      "id": 3,
      "image": "https://img.freepik.com/premium-photo/modern-beautiful-house-3d-illustration_101266-7512.jpg?w=740",
      "title": "Charming Townhouse",
      "segment_name": "Townhouse",
      "description": "Discover vintage charm and timeless appeal in this charming townhouse nestled within a peaceful historic district. With a quaint patio, laundry room, and central heating, it offers both comfort and convenience. Perfect for those seeking a sense of community and heritage, this townhouse is a serene sanctuary amidst the hustle and bustle of city life.",
      "price": 2500,
      "status": "rent",
      "area": 1500,
      "location": "Historic District",
      "facilities": ["Patio", "Laundry Room", "Central Heating"]
    },
    {
      "id": 4,
      "image": "https://img.freepik.com/free-photo/analog-landscape-city-with-buildings_23-2149661456.jpg?w=740",
      "title": "Luxury Villa with Ocean View",
      "segment_name": "Villa",
      "description": "Perched along the pristine beachfront, this luxurious villa boasts breathtaking ocean views and unparalleled amenities. With a private pool, jacuzzi, and home theater, it offers the epitome of coastal living. Whether lounging by the poolside or hosting gatherings in the expansive living spaces, residents can indulge in the ultimate luxury lifestyle.",
      "price": 1000000,
      "status": "sell",
      "area": 3500,
      "location": "Beachfront",
      "facilities": ["Private Pool", "Jacuzzi", "Home Theater"]
    },
    {
      "id": 5,
      "image": "https://img.freepik.com/free-photo/analog-landscape-city-with-buildings_23-2149661455.jpg?w=740",
      "title": "Sleek Loft in Urban Setting",
      "segment_name": "Loft",
      "description": "Embrace the vibrancy of city living in this sleek loft apartment, featuring industrial-chic design elements and modern amenities. With exposed brick walls, an open floor plan, and a roof deck, it offers a stylish retreat in the heart of the bustling city center. Ideal for urbanites seeking both style and substance, this loft epitomizes contemporary urban living.",
      "price": 1800,
      "status": "rent",
      "area": 900,
      "location": "City Center",
      "facilities": ["Exposed Brick Walls", "Open Floor Plan", "Roof Deck"]
    }
  ]
  